using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace lab2_alg
{
    public  static class RegionsAdjacency
    {
        public static Dictionary<string, List<string>> regions = new Dictionary<string, List<string>>()
    {
        {"Волинська", new List<string> {"Рівненська", "Львівська"}},

        {"Рівненська", new List<string> {
            "Волинська", "Житомирська", "Хмельницька", "Тернопільська", "Львівська"
        }},

        {"Львівська", new List<string> {
            "Волинська", "Рівненська", "Тернопільська", "Івано-Франківська", "Закарпатська"
        }},

        {"Закарпатська", new List<string> {
            "Львівська", "Івано-Франківська", "Чернівецька"
        }},

        {"Івано-Франківська", new List<string> {
            "Львівська", "Тернопільська", "Чернівецька", "Закарпатська"
        }},

        {"Тернопільська", new List<string> {
            "Рівненська", "Хмельницька", "Чернівецька", "Івано-Франківська", "Львівська"
        }},

        {"Чернівецька", new List<string> {
            "Івано-Франківська", "Тернопільська", "Хмельницька", "Вінницька"
        }},

        {"Хмельницька", new List<string> {
            "Рівненська", "Житомирська", "Вінницька", "Чернівецька", "Тернопільська"
        }},

        {"Житомирська", new List<string> {
            "Рівненська", "Київська", "Вінницька", "Хмельницька"
        }},

        {"Вінницька", new List<string> {
            "Житомирська", "Київська", "Черкаська", "Кіровоградська", "Одеська", "Чернівецька", "Хмельницька"
        }},

        {"Київська", new List<string> {
            "Житомирська", "Чернігівська", "Полтавська", "Черкаська", "Вінницька"
        }},

        {"Чернігівська", new List<string> {
            "Київська", "Полтавська", "Сумська"
        }},

        {"Сумська", new List<string> {
            "Чернігівська", "Полтавська", "Харківська"
        }},

        {"Полтавська", new List<string> {
            "Чернігівська", "Сумська", "Харківська", "Дніпропетровська", "Кіровоградська", "Черкаська", "Київська"
        }},

        {"Харківська", new List<string> {
            "Сумська", "Полтавська", "Дніпропетровська", "Донецька", "Луганська"
        }},

        {"Луганська", new List<string> {
            "Харківська", "Донецька"
        }},

        {"Донецька", new List<string> {
            "Луганська", "Харківська", "Дніпропетровська", "Запорізька"
        }},

        {"Дніпропетровська", new List<string> {
            "Полтавська", "Харківська", "Донецька", "Запорізька", "Херсонська", "Миколаївська", "Кіровоградська"
        }},

        {"Запорізька", new List<string> {
            "Донецька", "Дніпропетровська", "Херсонська"
        }},

        {"Херсонська", new List<string> {
            "Дніпропетровська", "Запорізька", "Миколаївська"
        }},

        {"Миколаївська", new List<string> {
            "Кіровоградська", "Дніпропетровська", "Херсонська", "Одеська"
        }},

        {"Одеська", new List<string> {
            "Вінницька", "Кіровоградська", "Миколаївська"
        }},

        {"Кіровоградська", new List<string> {
            "Вінницька", "Черкаська", "Полтавська", "Дніпропетровська", "Миколаївська", "Одеська"
        }},

        {"Черкаська", new List<string> {
            "Київська", "Полтавська", "Кіровоградська", "Вінницька"
        }}
    };
    }
}
